//Так ведь вроде как у БСП есть соответствующий программный интерфейс.
//https://its.1c.ru/db/bsp317doc#content:1875:hdoc

// ЗаписатьСвойстваУОбъекта
// Записывает дополнительные реквизиты и сведения владельцу свойств.
// Изменения происходят в транзакции.
// Синтаксис
// Процедура ЗаписатьСвойстваУОбъекта(ВладелецСвойств, ТаблицаСвойствИЗначений) Экспорт
// Параметры
//   ВладелецСвойств - ЛюбаяСсылка - например, СправочникСсылка.Номенклатура, ДокументСсылка.ЗаказПокупателя и т.д.
//   ТаблицаСвойствИЗначений - ТаблицаЗначений:
//     * Свойство - ПланВидовХарактеристикСсылка.ДополнительныеРеквизитыИСведения - свойство владельца.
//     * Значение - Произвольный - любое значение, допустимое для свойства (указано в элементе свойства).
// Пример вызова
 УправлениеСвойствами.ЗаписатьСвойстваУОбъекта(ВладелецСвойств, ТаблицаСвойствИЗначений)
// Доступность
// Сервер, Толстый клиент, Внешнее соединение