&НаСервере
Функция СохранитьВФайлНаСервере()
	ДанныеБелГИМТЗ = РеквизитФормыВЗначение("ДанныеБелГИМ");
	ПостроительОтчета = Новый ПостроительОтчета;
	ПостроительОтчета.ИсточникДанных = Новый ОписаниеИсточникаДанных(ДанныеБелГИМТЗ.Скопировать());
	
	ТабДок = Новый ТабличныйДокумент;
	ПостроительОтчета.Вывести(ТабДок);
	Возврат ТабДок;
КонецФункции

&НаКлиенте
Процедура СервисСохранитьТаблицуВТабДок(Команда)
	ДиалогВыбора 			= Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Сохранение);
	ДиалогВыбора.Заголовок 	= "Выберите файл";
	
	Если ДиалогВыбора.Выбрать() Тогда
		ТабДок 			= СохранитьВФайлНаСервере();
		ПолноеИмя 		= ДиалогВыбора.ПолноеИмяФайла;
		Расширение 		= ?(ЗначениеЗаполнено(ДиалогВыбора.Расширение), ДиалогВыбора.Расширение, "mxl");
		ИмяФайла 		= ПолноеИмя 
						+ "." + Расширение; 
		ТабДок.Записать(ИмяФайла, ТипФайлаТабличногоДокумента.MXL);
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Записан файл: "+ИмяФайла);
	КонецЕсли; 
КонецПроцедуры