&НаСервере
Функция ЗаполнитьПоДаннымБухгалтерскогоУчета(ТихийРежим = Истина, Контрагент = Неопределено)
	
	// Проверим заполненность обязательных реквизитов
	Если Не ПроверитьЗаполнение() Тогда
		Если ТихийРежим Тогда
			// Скроем сообщения об ошибках заполенения
			ПолучитьСообщенияПользователю(Истина);
		КонецЕсли;
		Возврат Неопределено;
	КонецЕсли;
	
	ДлительныеОперации.ОтменитьВыполнениеЗадания(ИдентификаторЗадания);
	
	ИдентификаторЗадания = Неопределено;
	
	СтруктураПараметров = Новый Структура;
	
	СтруктураПараметров.Вставить("ДатаНачала",    Объект.ДатаНачала);
	СтруктураПараметров.Вставить("ДатаОкончания", КонецДня(Объект.ДатаОкончания));
	СтруктураПараметров.Вставить("Организация",   Объект.Организация);
	СтруктураПараметров.Вставить("ВключатьОбособленныеПодразделения", Ложь);
	
	Если ЗначениеЗаполнено(Контрагент) Тогда
		СтруктураПараметров.Вставить("Контрагент", Контрагент);
	КонецЕсли;
	
	ВыбранныеСтатусыСверки = Новый СписокЗначений;
	Для Каждого Элемент Из ОтборСтатусыСверки Цикл
		Если Не Элемент.Пометка Тогда
			Продолжить;
		КонецЕсли;
		ВыбранныеСтатусыСверки.Добавить(Элемент.Значение);
	КонецЦикла;
	
	СтруктураПараметров.Вставить("Сортировка", Сортировка);
	
	СтруктураПараметров.Вставить("ОтбиратьПоСтатусуСверки",
		ВыбранныеСтатусыСверки.Количество() > 0 И ОтборСтатусыСверки.Количество() <> ВыбранныеСтатусыСверки.Количество());
	СтруктураПараметров.Вставить("СтатусыСверки", ВыбранныеСтатусыСверки);
	
	СтруктураПараметров.Вставить("Поставщики", Поставщики);
	СтруктураПараметров.Вставить("Покупатели", Покупатели);
	
	СчетаРасчетовСПоставщикамиМассив = СчетаРасчетовСПоставщиками.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СчетаРасчетовСПоставщикамиМассив , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	СтруктураПараметров.Вставить("СчетаРасчетовСПоставщиками", СчетаРасчетовСПоставщикамиМассив);
	
	СчетаРасчетовСПокупателямиМассив = СчетаРасчетовСПокупателями.ВыгрузитьЗначения();
	ОбщегоНазначенияКлиентСервер.УдалитьВсеВхожденияЗначенияИзМассива(СчетаРасчетовСПокупателямиМассив , ПланыСчетов.Хозрасчетный.ПустаяСсылка());
	// Во избежание дубирования данных о расчетах уберем из массива счетов покупателей те, что уже есть в счетах поставщиков
	Если Поставщики Тогда
		ОбщегоНазначенияКлиентСервер.РазностьМассивов(
			СчетаРасчетовСПокупателямиМассив, СчетаРасчетовСПоставщикамиМассив);
	КонецЕсли;
	СтруктураПараметров.Вставить("СчетаРасчетовСПокупателями", СчетаРасчетовСПокупателямиМассив);
	
	СтруктураПараметров.Вставить("КонтрагентыСОстаткамиПрошлыхПериодов", КонтрагентыСОстаткамиПрошлыхПериодов);
	СтруктураПараметров.Вставить("КонтрагентыСРасчетамиБезОстатков", КонтрагентыСРасчетамиБезОстатков);
	СтруктураПараметров.Вставить("СхемаКомпоновкиДанных", ПолучитьИзВременногоХранилища(СхемаКомпоновкиДанных));
	СтруктураПараметров.Вставить("НастройкиКомпоновкиДанных", КомпоновщикНастроек.ПолучитьНастройки());
	
	Если ЭтоАдресВременногоХранилища(АдресХранилищаСОшибками) Тогда
		УдалитьИзВременногоХранилища(АдресХранилищаСОшибками);
		АдресХранилищаСОшибками = "";
	КонецЕсли;
	
	АдресХранилищаСОшибками = ПоместитьВоВременноеХранилище(Неопределено, УникальныйИдентификатор);
	СтруктураПараметров.Вставить("АдресХранилищаСОшибками", АдресХранилищаСОшибками);
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияВФоне(УникальныйИдентификатор);
	ПараметрыВыполнения.НаименованиеФоновогоЗадания = "ЗаполнитьКонтрагентовДляСверки";
	ПараметрыВыполнения.ЗапуститьВФоне = Истина;
	ПараметрыВыполнения.Вставить("ИдентификаторФормы", УникальныйИдентификатор);	
	
	//++@Anatoliy_Muz 20.03.2026 
	
	//    //ссылка на доп. обработку, подключенную к базе. В данном примере ищем по наименованию, указанному в Сведениях о внешней обработке
	ДополнительнаяОбработкаСсылка =  Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("(DN) монитор сверки с контрагентами");
	//    //запуск фоновой процедуры происходит через метод "ВыполнитьПроцедуруМодуляОбъектаОбработки", куда мы передаем данные об обработке и о процедуре, которую необходимо запустить
	ВыполняемыйМетод = "ДлительныеОперации.ВыполнитьПроцедуруМодуляОбъектаОбработки";
	
	ПараметрыЗадания = Новый Структура;
	//    //имя внешней обработки
	ПараметрыЗадания.Вставить("ИмяОбработки", "ВнешняяОбработка.ДлительныеОперацииВоВнешнейОбработке");
	//    //имя экспортной серверной процедуры обработки
	ПараметрыЗадания.Вставить("ИмяМетода", "ПолучитьДанныеСверкиСКонтрагентами");
	//    //входящие параметры процедуры 
	ПараметрыЗадания.Вставить("ПараметрыВыполнения", СтруктураПараметров);
	//    //признак внешней обработки
	ПараметрыЗадания.Вставить("ЭтоВнешняяОбработка", Истина);
	//    //ссылка на доп. обработку в базе
	ПараметрыЗадания.Вставить("ДополнительнаяОбработкаСсылка",ДополнительнаяОбработкаСсылка);
	//
	//    //запускаем выполнение фонового задания
	СтруктураФоновогоЗадания = ДлительныеОперации.ВыполнитьВФоне(ВыполняемыйМетод, ПараметрыЗадания, ПараметрыВыполнения);
	//--@Anatoliy_Muz 20.03.2026 
	
		
	ИдентификаторЗадания = СтруктураФоновогоЗадания.ИдентификаторЗадания;
		
	Возврат СтруктураФоновогоЗадания;
	
КонецФункции

&НаКлиенте
Процедура ЗаполнитьДаннымиБухгалтерскогоУчетаНаКлиенте(ТихийРежим = Истина, Контрагент = Неопределено)
	
	Результат = ЗаполнитьПоДаннымБухгалтерскогоУчета(ТихийРежим, Контрагент);
//	Результат = ЗаполнитьПоДаннымБухгалтерскогоУчета_Типовой(ТихийРежим, Контрагент); //Для отладки модуля в конфигурации
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
	ОповещениеОЗавершении = Новый ОписаниеОповещения(
		"ЗаполнитьПоДаннымБухгалтерскогоУчетаЗавершение",
		ЭтотОбъект,
		Контрагент);
	ДлительныеОперацииКлиент.ОжидатьЗавершение(Результат, ОповещениеОЗавершении, ПараметрыОжидания);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоДаннымБухгалтерскогоУчетаЗавершение(Результат, Контрагент) Экспорт
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	РезультатВыполнения = ЗагрузитьПодготовленныеДанные(Результат, Контрагент);
	
	Если Не РезультатВыполнения.Успешно Тогда
		ОбщегоНазначенияБПКлиент.ОткрытьФормуОшибокПерепроведения(ЭтотОбъект, АдресХранилищаСОшибками);
	КонецЕсли;
	
КонецПроцедуры
