&НаСервере
Функция ПечатьНаСервере(Период)
	//МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода 
	 //ОбъектДокумент = ДанныеФормыВЗначение(объект, );//тип("внешнийОтчет.ПротоколWord")
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	МассивОбъектов = новый массив();
	МассивОбъектов.Добавить(Период);
	
	КоллекцияПечатныхФорм = новый ТаблицаЗначений;
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяВРЕГ");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ИмяФайлаПечатнойФормы");
	КоллекцияПечатныхФорм.Колонки.Добавить("Картинка");
	КоллекцияПечатныхФорм.Колонки.Добавить("ОфисныеДокументы");
	КоллекцияПечатныхФорм.Колонки.Добавить("ПолныйПутьКМакету");
	КоллекцияПечатныхФорм.Колонки.Добавить("СинонимМакета");
	КоллекцияПечатныхФорм.Колонки.Добавить("ТабличныйДокумент");
	КоллекцияПечатныхФорм.Колонки.Добавить("Экземпляров");
	КоллекцияПечатныхФорм.Колонки.Добавить("ДоступенВыводНаДругихЯзыках");

	
	новаяСтрокаКоллекцииПечатныхФорм = КоллекцияПечатныхФорм.Добавить();
	новаяСтрокаКоллекцииПечатныхФорм.ИмяВРЕГ = Врег("ПечатьАктСписанияСпиртаДоп");
	новаяСтрокаКоллекцииПечатныхФорм.ИмяМакета = "ПечатьАктСписанияСпиртаДоп";
	новаяСтрокаКоллекцииПечатныхФорм.Экземпляров = 1;
	
	ОбъектыПечати = новый СписокЗначений;
	//ОбъектыПечати.Добавить(Объект.СсылкаНаОбъект);
	ПараметрыВывода = новый Структура;
	
	ДокументОбъект.Печать( МассивОбъектов, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода );
	МассивПечатныхФорм = ОбщегоНазначения.ТаблицаЗначенийВМассив(КоллекцияПечатныхФорм);
	Возврат МассивПечатныхФорм;
	//УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм, ОбластиОбъектов);
	
КонецФункции

&НаКлиенте
Процедура Печать(Команда)
	Если ЗначениеЗаполнено(Период.ДатаНачала) И ЗначениеЗаполнено(Период.ДатаОкончания) Тогда
		//ТабДокПеч = ПечатьНаСервереФ(Период); 
		//ТабДокПеч.Показать();
		
		МассивПечатныхФорм = ПечатьНаСервере(Период);
		УправлениеПечатьюКлиент.ПечатьДокументов(МассивПечатныхФорм, , ЭтаФорма);	
		
		//КоллекцияПечатныхФорм = УправлениеПечатьюКлиент.НоваяКоллекцияПечатныхФорм("ПечатьАктСписанияСпиртаДоп");
		//УправлениеПечатьюКлиент.ПечатьДокументов(КоллекцияПечатныхФорм);
		
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период на заполнен");
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	//Переменн = 1;
КонецПроцедуры

&НаСервере
Функция ПечатьНаСервереФ(Период)
	ДокументОбъект = РеквизитФормыВЗначение("Объект");
	МассивОбъектов = новый массив();
	МассивОбъектов.Добавить(Период);
	Возврат ДокументОбъект.Печать(МассивОбъектов);
КонецФункции