&НаКлиенте
Процедура ОтчетДублиНомеровСвидетельствЗаключений(Команда)
   //Подключение нужно только для внешнего отчета    
    Если СсылкаНаОбработку() Тогда
        
        КлючВарианта = ПолучитьКлючВариантаОтчета();
        ПараметрыФормы = Новый Структура("КлючВарианта", КлючВарианта);
        ОткрытьФорму("ВнешнийОтчет.М_ДублиНомеровСвидетельствЗаключений.Форма", ПараметрыФормы);        
        
    КонецЕсли;
КонецПроцедуры

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьКлючВариантаОтчета()
    
    СписокВариантов = ХранилищеВариантовОтчетов.ПолучитьСписок("ВнешнийОтчет.М_ДублиНомеровСвидетельствЗаключений");
    Если СписокВариантов.Количество() = 0 Тогда
        Возврат Неопределено;
    КонецЕсли;
    
    Возврат СписокВариантов[0].Значение;
    
КонецФункции


&НаСервере
Функция СсылкаНаОбработку()
    ОтчетСсылка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоНаименованию("(М) Дубли номеров свидетельств/заключений");
    Если ОтчетСсылка.Пустая() Тогда
        Сообщить("Не удалось найти внешний отчет");
        Возврат Ложь;
    КонецЕсли;
    
    ДвоичныеДанные = ОтчетСсылка.ХранилищеОбработки.Получить();
    АдресХранилища = ПоместитьВоВременноеХранилище(ДвоичныеДанные);
    ВнешниеОтчеты.Подключить(АдресХранилища, "Отчет");
    
    Возврат Истина;
КонецФункции
