РезультатПоиска = СтрНайтиПоРегулярномуВыражению(Реквизит.Ключ, "ТитулЗаказчикаОписаниеГруза__\d{1,3}__ИдентификаторСтроки");
Если РезультатПоиска.НачальнаяПозиция > 0 Тогда 
	НомерСтрокиБезПодчеркивания = НомерСтроки(Реквизит.Ключ);
	Если СтруктураРеквизитов.Свойство("ТитулЗаказчикаОписаниеГрузаСвСтрПроисх__" 
			+ НомерСтрокиБезПодчеркивания + "__ИдентификаторСтроки") Тогда
		Ключ = "ТитулЗаказчикаОписаниеГрузаСвСтрПроисх__" + НомерСтрокиБезПодчеркивания + "__ИдентификаторСтрокиРодителя";
		СтруктураРеквизитов.Вставить(Ключ, Реквизит.Значение);
	Иначе
		Ключ = "ТитулЗаказчикаОписаниеГрузаСвСтрПроисх__" + НомерСтрокиБезПодчеркивания + "__";
		СтруктураРеквизитов.Вставить(Ключ + "ИдентификаторСтрокиРодителя", Реквизит.Значение);
		СтруктураРеквизитов.Вставить(Ключ + "ИдентификаторСтроки", Строка(Новый УникальныйИдентификатор));
		СтруктураРеквизитов.Вставить(Ключ + "КодСтраны", "156");
		СтруктураРеквизитов.Вставить(Ключ + "НаименованиеСтраны", "КИТАЙ");
		СтруктураРеквизитов.Вставить(Ключ + "СсылкаСтрана", Справочники.СтраныМира.НайтиПоКоду("156"));
	КонецЕсли;

КонецЕсли;
