	ГруппаИЛИ = ОбщегоНазначенияКлиентСервер.СоздатьГруппуЭлементовОтбора(
	    ЖурналДеньги.Отбор, 
	    "ПоискПУсловию", 
	    ТипГруппыЭлементовОтбораКомпоновкиДанных.ГруппаИЛИ
	);
	Для каждого СтрокаУсловие Из ТЗУслуги Цикл
	     Если СтрокаУсловие.Количество < 2 Тогда
		 	Продолжить;
		КонецЕсли;
		Для каждого Условие Из СтрокаУсловие.Элементы Цикл
			// Добавляем конкретные условия внутрь созданной группы
			ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбора(
			    ГруппаИЛИ, 
			    СтрокаУсловие.Реквизит, 
			    Условие.Значение, 
			    ВидСравненияКомпоновкиДанных.Равно,,,РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ
			);
		КонецЦикла;
	КонецЦикла;
