	ОбщегоНазначенияКлиентСервер.УдалитьЭлементыГруппыОтбораДинамическогоСписка(ЖурналДеньги,"Тип"); 
	ОбщегоНазначенияКлиентСервер.УстановитьЭлементОтбораДинамическогоСписка(
	    ЖурналДеньги,                       // Динамический список
	    "Тип",                     // Имя поля (реквизита) для отбора
	    Тип("ДокументСсылка." + ИмяДокумента),			//Объект.Контрагент,                  // Правое значение отбора
	    ВидСравненияКомпоновкиДанных.Равно, // Вид сравнения
	    ,                                   // Представление (необязательно)
	    Истина,                              // Использование (Вкл/Выкл)
		РежимОтображенияЭлементаНастройкиКомпоновкиДанных.БыстрыйДоступ
	);