	ОбъектВнешенгоОтчета = РеквизитФормыВЗначение("Отчет");
	СхемаКомпоновкиДанных = ОбъектВнешенгоОтчета.ПолучитьМакет("СКД_ЭтапыПоставкиОплаты");
	
	//Из схемы возьмем настройки по умолчанию
	Настройки = СхемаКомпоновкиДанных.НастройкиПоУмолчанию;
	
	//Помещаем в переменную данные о расшифровке данных
	ДанныеРасшифровки = Новый ДанныеРасшифровкиКомпоновкиДанных;
	
	//Формируем макет, с помощью компоновщика макета
	КомпоновщикМакета = Новый КомпоновщикМакетаКомпоновкиДанных;
	
	//Передаем в макет компоновки схему, настройки и данные расшифровки
	МакетКомпоновки = КомпоновщикМакета.Выполнить(СхемаКомпоновкиДанных, Настройки, ДанныеРасшифровки);
	
	//Выполним компоновку с помощью процессора компоновки
	ПроцессорКомпоновкиДанных = Новый ПроцессорКомпоновкиДанных;
	ПроцессорКомпоновкиДанных.Инициализировать(МакетКомпоновки, , );//ДанныеРасшифровки
	
	//Очищаем поле табличного документа
	Результат = Элементы.Результат;
	Результат.Очистить(); 
	
	ТабДок = Новый ТабличныйДокумент;
	ТабДок.Очистить();
//	Выводим результат в табличный документ
	ПроцессорВывода = Новый ПроцессорВыводаРезультатаКомпоновкиДанныхВТабличныйДокумент;
	ПроцессорВывода.УстановитьДокумент(ТабДок);
	
	ПроцессорВывода.Вывести(ПроцессорКомпоновкиДанных); 
	//ПроцессорВывода.НачатьВывод();
	//Пока Истина Цикл
	//	ЭлементРезультата = ПроцессорКомпоновкиДанных.Следующий();
	//	Если ЭлементРезультата= Неопределено Тогда
	//		Прервать;    
	//	КонецЕсли;
	//	ПроцессорВывода.ВывестиЭлемент(ЭлементРезультата);
	//КонецЦикла;
	//ПроцессорВывода.ЗакончитьВывод();
    Возврат ТабДок;
