//Сохранить/загрузить настройки формы отчета из/в ХранилищеОбщихНастроек</h1>
	&НаСервере
	процедура СохранитьЗначенияРеквезитов()
		
		ОписаниеНастройки = Новый ОписаниеНастроек;
		ОписаниеНастройки.Представление = "ПараметрыНастройкиОтчета";//название параметров
		ПараметрыНастройкиОтчета=новый структура;
		ПараметрыНастройкиОтчета.Вставить("НачалоПериода", отчет.НачалоПериода);//перечень реквизитов 
		ПараметрыНастройкиОтчета.Вставить("КонецПериода", отчет.КонецПериода); // отчет-обращение к основному реквизиту формы
		ПараметрыНастройкиОтчета.Вставить("Организация", отчет.Организация);
		ХранилищеОбщихНастроек.Сохранить(ЭтаФорма, "ПараметрыНастройкиОтчета", ПараметрыНастройкиОтчета, ОписаниеНастройки);
		
	КонецПроцедуры

	&НаКлиенте
	Процедура ПриЗакрытии(ЗавершениеРаботы)
		СохранитьЗначенияРеквезитов();
	КонецПроцедуры
//	загрузить настройки формы отчета из ХранилищеОбщихНастроек
	&НаСервере
	Процедура ВостановитьНастроки()
		ОписаниеНастройки = Новый ОписаниеНастроек;
		ОписаниеНастройки.Представление = "ПараметрыНастройкиОтчета";
		
		ПараметрыНастройкиОтчета=ХранилищеОбщихНастроек.Загрузить(ЭтаФорма, "ПараметрыНастройкиОтчета",  ОписаниеНастройки);
		Если ПараметрыНастройкиОтчета<>Неопределено тогда
			ЗаполнитьЗначенияСвойств(отчет,ПараметрыНастройкиОтчета); //отчет - основной реквизит формы отчета
		КонецЕсли;
		
	КонецПроцедуры

	&НаКлиенте
	Процедура ПриОткрытии(Отказ)
		 ВостановитьНастроки()
	 КонецПроцедуры
