Процедура ИмяПроцедуры()
	Письмо = Новый ИнтернетПочтовоеСообщение;
	Письмо.Тема = "Акт сдачи-приемки и Спецификация";
	Письмо.Тексты.Добавить("Акт сдачи-приемки и Спецификация");
	Письмо.Получатели.Добавить(EmailСотрудника); 
	Письмо.Вложения.Добавить(ДвоичныеДанные, ПолучитьИмяВременногоФайла("pdf")); 
	РаботаСПочтовымиСообщениями.ОтправитьПисьмо(
		Справочники.УчетныеЗаписиЭлектроннойПочты.НайтиПоНаименованию("buh3@dn.ru"),
		 Письмо);
КонецПроцедуры


// + Прайм 6912 23.04.25
Функция ПечатьДокументов(СсылкаНаДокумент, ОбъектыПечати, ДвоичныеДанные) Экспорт 
	
	ДвоичныеДанные = Неопределено;
	Возврат СклеитьТабличныеДокументы(СформироватьПечатнуюФормуАкт(СсылкаНаДокумент, ОбъектыПечати), СформироватьПечатнуюФормуСпецификация(СсылкаНаДокумент, ОбъектыПечати), ДвоичныеДанные);
	
КонецФункции 

Функция СклеитьТабличныеДокументы(ТабДок1, ТабДок2, ДвоичныеДанные)
		
	ТаблДокИзДвух = Новый ТабличныйДокумент;
	ТаблДокИзДвух.Вывести(ТабДок1); 
	ТаблДокИзДвух.ВывестиГоризонтальныйРазделительСтраниц();
	ТаблДокИзДвух.Вывести(ТабДок2);
	
	Поток = Новый ПотокВПамяти;
	ТаблДокИзДвух.Записать(Поток, ТипФайлаТабличногоДокумента.PDF); 
	ДвоичныеДанные = Поток.ЗакрытьИПолучитьДвоичныеДанные();	
	
	Возврат ДвоичныеДанные;
	
КонецФункции