//++@Anatoliy_Muz 24.03.2026 
&НаКлиенте
Процедура АЗ_ПриОткрытииПосле(Отказ)
	ДобавитьКомандуПоказатьПравилаФормы();
КонецПроцедуры
//--@Anatoliy_Muz 24.03.2026 

//++@Anatoliy_Muz 24.03.2026 
&НаСервере
Процедура ДобавитьКомандуПоказатьПравилаФормы()
	НоваяКоманда = Команды.Добавить("ПоказатьПравилаАвтозаполнения");
	НоваяКоманда.Действие = "КомандаФормыПоказатьПравилаАвтозаполнения";
	НоваяКоманда.Заголовок = "Правила автозаполнения";
	КартинкаКнопки = БиблиотекаКартинок.ПрименитьПравилаОбработкиПисем;
	НоваяКоманда.Картинка = КартинкаКнопки;
	НоваяКоманда.Отображение = ОтображениеКнопки.Картинка;
	
	НовыйЭлемент = Элементы.Добавить("КнопкаПоказатьПравилаАвтозаполнения", Тип("КнопкаФормы"), Элементы.ДокументыКИмпорту.КоманднаяПанель);
	НовыйЭлемент.ИмяКоманды = "ПоказатьПравилаАвтозаполнения";
	НовыйЭлемент.КнопкаПоУмолчанию = Ложь;
КонецПроцедуры //ДобавитьКомандуПоказатьПравилаФормы

&НаКлиенте
Процедура КомандаФормыПоказатьПравилаАвтозаполнения(Команда)
	
КонецПроцедуры

//--@Anatoliy_Muz 24.03.2026 