&НаСервере
Процедура ДобавитьРеквизитыФормы()
	ДобавляемыеРеквизиты = Новый Массив; //Определяем массив добавляемых реквизитов
	НовыйРеквизит = Новый РеквизитФормы("ПриглашениеЭДО",Новый ОписаниеТипов("Строка"), "Список", "Приглашение ЭДО"); 
	ДобавляемыеРеквизиты.Добавить(НовыйРеквизит);	
	ЭтаФорма.ИзменитьРеквизиты(ДобавляемыеРеквизиты); //Применяем реквизиты
	
	ЭлементФормыПриглашениеЭДО = Элементы.Добавить("ПриглашениеЭДО", Тип("ПолеФормы"), Элементы.Список);
	ЭлементФормыПриглашениеЭДО.ПутьКДанным = "Список.ПриглашениеЭДО";
КонецПроцедуры