&НаСервере
Процедура ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	ДобавитьУсловноеОформление();
КонецПроцедуры

&НаСервере
Процедура ДобавитьУсловноеОформление()
	ЭлементОформления = Список.УсловноеОформление.Элементы.Добавить();
	// Создаем условие отбора
	ЭлементОтбора = ЭлементОформления.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ЭлементОтбора.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ОбособкаИлиГоловное"); // имя поля
	ЭлементОтбора.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно; // либо задаем свой
	ЭлементОтбора.ПравоеЗначение = Истина;
	ЭлементОтбора.Использование = Истина;
	
	Элемент = ЭлементОформления.Оформление.Элементы[0];
	ЭлементОформления.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Желтый);
	Элемент.Использование = Истина;
	
	//ПолеОформления = ЭлементОформления.Поля.Элементы.Добавить();
	//ПолеОформления.Поле = Новый ПолеКомпоновкиДанных("Список");
	//ПолеОформления.Использование = Истина;

КонецПроцедуры
