//Выбор каталога в диалоге
  &НаКлиенте
Процедура ПутьКБазеНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	ОповещениеПослеВыбораКаталога = новый ОписаниеОповещения("ПослеВыбораКаталога", этотОбъект);
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	Диалог.Фильтр = НСтр("ru='каталог с файлами DBF(*.dbf)'");
	Диалог.Заголовок = "Укажите путь к каталогу с DBF файлами";
	Диалог.Показать(ОповещениеПослеВыбораКаталога);
КонецПроцедуры  

&НаКлиенте
Процедура ПослеВыбораКаталога(Результат, допПараметры) экспорт
	ПутьККаталогуDBF = Результат[0];
КонецПроцедуры
