// источник: 
//https://moscowsoft.com/statii/programmirovanie_na_1s_predpriyatie/preobrazovat_chislo_v_stroku_v_zaprose_1s/?srsltid=AU7gw4VwrYetGOFf-CBQW_ExNCcKkbrej-B_qfbLbH2O_teFpaSu6x0X
Запрос = Новый Запрос;

// Установка значений параметров
Запрос.УстановитьПараметр("Символ160", Символ(160));
Запрос.УстановитьПараметр("Дата", Дата(2026, 1, 1));

Запрос.Текст =
"выбрать 
|счет.Ссылка,
|счет.номер как номер,
|СтрЗаменить(строка(счет.san_id_crm), &Символ160, """") как id 
|из Документ.СчетНаОплатуПокупателю как счет
|где строка(счет.san_id_crm) <>счет.Номер
|и счет.san_id_crm<>0
|и счет.Дата>=&Дата
|УПОРЯДОЧИТЬ по счет.дата";
РезультатЗапроса = Запрос.Выполнить();

// Выборка
Выборка = РезультатЗапроса.Выбрать();
Пока Выборка.Следующий() Цикл
	// Код
КонецЦикла;